<?php
//    print_r($_REQUEST)
//session_start();
//$param1 = $_GET["param1"];
//$param2 = $_GET["param2"];
//
//$res = $param1 + $param2;
//$res1 = $param1 - $param2;
//$res2 = $param1 * $param2;
//$res3 = $param1 / $param2;
//$data = array('p1'=>$param1,'p2'=>$param2, 'res'=>$res, 'res1'=>$res1,'res2'=>$res2,'res3'=>$res3);
//$jsonString = json_encode($data);
//echo $jsonString;

//$data = array('p1'=>123,'p2'=>354);
//foreach ($data as $key => $value){
//    echo $key.":".$value."<br>";
//}
//
//$arr = array(1,1,1,1,1,1,1,1,1);
//for($i=0;$i<count($arr);$i++){
//    echo $arr[$i]."<br>";
//}
//echo array_sum($arr);
//
//
//$a = 23;
//$b = 34;
//$c = 12;
//
//if (($a>$b)and($a>$c)and($b>$c)){
//    echo  $a." ".$b." ".$c."<br>";
//} elseif (($a>$b)and($a>$c)and($b>$c)){
//
//}

//$z = 1;
//$fn = fn($x) => fn($y) => $x * $y + $z;
//
//// Выведет 51
//var_export($fn(5)(10));

//---------------------------------------------------------------------------

/**
 * Задача 1
 * Создать функцию вычисления квадрата числа, без использования встроенной функции
 */
/**
 * Задача 2
 * Создать функцию, которая определяет наибольшее значение из двух чисел, без использования встроенной функции
 */
/**
 * Задача 3
 * Создать фнкцию,которая приимает в аргументе массив, определяет максимальный элемент и возвращает его
 */
/**
 * Задача 4
 * Создать функцию, которая вычисляет площадь круга или квадрата, по заданным парамерам
 *
 */
/**
 * Задача 5
 * Создать функцию, которая определяет длину ассоциативного массива
 */

print ('Задача 1');
echo "<p></p>";
function  foo($num)
{
    return $num * $num;
}
echo foo(4);

echo "<p></p>";

print ('Задача 2');
echo "<p></p>";
$a = 56;
$b = 76;
if ($a > $b){
    echo $a;
}
else {
    echo $b;
}

echo "<p></p>";
print ('Задача 3');
echo "<p></p>";

$frt = [1,2,10,3,7];
echo max($frt);

echo "<p></p>";
print ('Задача 4');
echo "<p></p>";

function pl($r)
{
    return M_PI*($r*$r);
}
print pl(3)

//---------------------------------------------------------------------------






?>



